app/Controllers/AdminPortal.php

    public function applicationDetail($id)
    {
        $data['application'] = $this->applicationModel->getApplicationWithUser($id);

        if (!$data['application']) {
            return redirect()->to('/admin/applications')->with('error', 'Application not found');
        }

        // Fetch documents for this application
        $documentModel = new \App\Models\ApplicationDocumentModel();
        $data['documents'] = $documentModel
            ->where('application_id', $id)
            ->first();

        // Fetch payment details for this application
        $paymentModel = new PaymentModel();
        $data['payment'] = $paymentModel
            ->where('application_id', $id)
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT *
FROM `application_documents`
WHERE `application_id` = '3'
 LIMIT 1
SELECT *
FROM `payments`
WHERE `application_id` = '3'
ORDER BY `created_at` DESC
 LIMIT 1

    public function lottery()
    {
        // List all verified applications with user + category details
        $applications = $this->applicationModel
            ->select('applications.*, users.name as user_name, users.mobile, users.category as user_category')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->where('applications.status', 'verified')
            ->orderBy('applications.created_at', 'ASC')
            ->findAll();

        // Get available plots grouped by category
        $plotModel = new PlotModel();
        $availablePlots = $plotModel
            ->where('status', 'available')
            ->orderBy('category', 'ASC')
            ->findAll();
---
SELECT `applications`.*, `users`.`name` as `user_name`, `users`.`mobile`, `users`.`category` as `user_category`
FROM `applications`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `applications`.`status` = 'verified'
ORDER BY `applications`.`created_at` ASC
SELECT *
FROM `plots`
WHERE `status` = 'available'
ORDER BY `category` ASC

    public function runLottery()
    {
        if ($this->request->getPost('round_number') === null) {
            return $this->response->setStatusCode(400)
                ->setJSON(['success' => false, 'message' => 'Invalid request']);
        }

        $roundNumber = trim((string) $this->request->getPost('round_number'));
        $roundName   = trim((string) $this->request->getPost('round_name'));
        $confirmed   = (bool) $this->request->getPost('confirmed');

        if ($roundNumber === '' || $roundName === '') {
            return $this->response->setStatusCode(400)
                ->setJSON(['success' => false, 'message' => 'Please enter lottery round number and name.']);
        }

        if (! $confirmed) {
            return $this->response->setStatusCode(400)
                ->setJSON(['success' => false, 'message' => 'Please confirm that you want to run the lottery.']);
        }

        $plotModel      = new PlotModel();
        $allotmentModel = new AllotmentModel();

        // Get verified applications with user category (for matching with plot category)
        $applications = $this->applicationModel
            ->select('applications.*, users.name as user_name, users.mobile, users.category as user_category')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->where('applications.status', 'verified')
            ->orderBy('applications.created_at', 'ASC')
            ->findAll();
---
SELECT `applications`.*, `users`.`name` as `user_name`, `users`.`mobile`, `users`.`category` as `user_category`
FROM `applications`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `applications`.`status` = 'verified'
ORDER BY `applications`.`created_at` ASC

            'created_at'     => date('Y-m-d H:i:s'),
        ];

        if (! $db->table('allotments')->insert($allotmentData)) {
---
INSERT INTO `allotments` (`application_id`, `plot_number`, `block_name`, `status`, `created_at`, ) VALUES ('2', '1230456', 'kgjnkdskg', 'provisional', '2026-02-13 12:01:54', '2026-02-13 12:01:54')

            if ($newQty === 0) {
                $update['status'] = 'allotted';
            }
            if (! $plotModel->update($plot['id'], $update)) {
---
UPDATE `plots` SET `available_quantity` = 0, `status` = 'allotted', `updated_at` = '2026-02-13 12:01:54'
WHERE `plots`.`id` IN ('3')

    public function allotments()
    {
        $allotmentModel = new AllotmentModel();

        // Fetch allotments with application and user details
        $allotments = $allotmentModel
            ->select('allotments.*, applications.id as application_id, applications.full_name, users.name as user_name')
            ->join('applications', 'applications.id = allotments.application_id', 'left')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->orderBy('allotments.created_at', 'DESC')
            ->findAll();
---
SELECT `allotments`.*, `applications`.`id` as `application_id`, `applications`.`full_name`, `users`.`name` as `user_name`
FROM `allotments`
LEFT JOIN `applications` ON `applications`.`id` = `allotments`.`application_id`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
ORDER BY `allotments`.`created_at` DESC