app/Controllers/AdminPortal.php

        }

        // List existing admins (simple overview)
        $data['admins'] = $this->adminModel
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `admins`
ORDER BY `created_at` DESC

    public function applications()
    {
        $applications = $this->applicationModel->getApplicationsWithUsers();

        // Get payment status for each application
        $paymentModel = new PaymentModel();
        foreach ($applications as &$app) {
            $payment = $paymentModel
                ->where('application_id', $app['id'])
                ->orderBy('created_at', 'DESC')
                ->first();
---
SELECT *
FROM `payments`
WHERE `application_id` = '3'
ORDER BY `created_at` DESC
 LIMIT 1

    public function users()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC

    public function applicationDetail($id)
    {
        $data['application'] = $this->applicationModel->getApplicationWithUser($id);

        if (!$data['application']) {
            return redirect()->to('/admin/applications')->with('error', 'Application not found');
        }

        // Fetch documents for this application
        $documentModel = new \App\Models\ApplicationDocumentModel();
        $data['documents'] = $documentModel
            ->where('application_id', $id)
            ->first();

        // Fetch payment details for this application
        $paymentModel = new PaymentModel();
        $data['payment'] = $paymentModel
            ->where('application_id', $id)
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT *
FROM `application_documents`
WHERE `application_id` = '9'
 LIMIT 1
SELECT *
FROM `payments`
WHERE `application_id` = '9'
ORDER BY `created_at` DESC
 LIMIT 1

    public function lottery()
    {
        // List all verified applications with user + category details
        $applications = $this->applicationModel
            ->select('applications.*, users.name as user_name, users.mobile, users.category as user_category')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->where('applications.status', 'verified')
            ->orderBy('applications.created_at', 'ASC')
            ->findAll();

        // Get all available plots
        $plotModel = new PlotModel();
        $allPlotsFromDb = $plotModel
            ->where('status', 'available')
            ->orderBy('category', 'ASC')
            ->orderBy('plot_number', 'ASC')
            ->findAll();
---
SELECT `applications`.*, `users`.`name` as `user_name`, `users`.`mobile`, `users`.`category` as `user_category`
FROM `applications`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `applications`.`status` = 'verified'
ORDER BY `applications`.`created_at` ASC
SELECT *
FROM `plots`
WHERE `status` = 'available'
ORDER BY `category` ASC, `plot_number` ASC


        // Get all allotted plots (winners) - include chalan_id to show View Chalan when paid
        $allotmentModel = new AllotmentModel();
        $allottedPlots = $allotmentModel
            ->select('allotments.*, applications.id as application_id, applications.full_name, applications.mobile as application_mobile, users.name as user_name, users.mobile as user_mobile, chalans.id as chalan_id')
            ->join('applications', 'applications.id = allotments.application_id', 'left')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->join('chalans', 'chalans.allotment_id = allotments.id', 'left')
            ->orderBy('allotments.created_at', 'DESC')
            ->findAll();

        // Add plot details by lookup (avoids utf8mb4_unicode_ci vs utf8mb4_general_ci join error)
        $allPlots = $plotModel->findAll();
---
SELECT `allotments`.*, `applications`.`id` as `application_id`, `applications`.`full_name`, `applications`.`mobile` as `application_mobile`, `users`.`name` as `user_name`, `users`.`mobile` as `user_mobile`, `chalans`.`id` as `chalan_id`
FROM `allotments`
LEFT JOIN `applications` ON `applications`.`id` = `allotments`.`application_id`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
LEFT JOIN `chalans` ON `chalans`.`allotment_id` = `allotments`.`id`
ORDER BY `allotments`.`created_at` DESC
SELECT *
FROM `plots`

        try {
            $db = \Config\Database::connect();
            if ($db->fieldExists('lottery_category', 'allotments')) {
                $rows = $db->table('allotments')
                    ->select('lottery_category')
                    ->distinct()
                    ->where('lottery_category !=', '')
                    ->where('lottery_category IS NOT NULL', null, false)
                    ->get()
                    ->getResultArray();
---
SELECT DISTINCT `lottery_category`
FROM `allotments`
WHERE `lottery_category` != ''
AND lottery_category IS NOT NULL

        $db             = \Config\Database::connect();

        // STEP 1: Filter Applicants by Category and Service Category
        $applications = $this->applicationModel
            ->select('applications.*, users.name as user_name, users.mobile, users.category as user_category')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->where('applications.status', 'verified')
            ->findAll();
---
SELECT `applications`.*, `users`.`name` as `user_name`, `users`.`mobile`, `users`.`category` as `user_category`
FROM `applications`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `applications`.`status` = 'verified'

            // Match if caste category matches AND service category matches
            if ($casteMatch && $serviceMatch) {
                // Exclude applications that already have allotments
                $existingAllotment = $db->table('allotments')
                    ->where('application_id', $app['id'])
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `allotments`
WHERE `application_id` = '11'

                'created_at'       => date('Y-m-d H:i:s'),
            ];

            if ($db->table('allotments')->insert($allotmentData)) {
---
INSERT INTO `allotments` (`application_id`, `plot_number`, `block_name`, `status`, `lottery_round`, `lottery_category`, `created_at`) VALUES ('11', 'E40', 'Housing Scheme', 'provisional', 'SC-1', 'SC', '2026-02-19 05:57:49')

                $allotmentIds[] = $allotmentId;

                // Mark plot as allotted
                $plotModel->update($plot['id'], ['status' => 'allotted']);

                // Update application status to selected
                $this->applicationModel->update($winner['id'], ['status' => 'selected']);
---
UPDATE `plots` SET `status` = 'allotted', `updated_at` = '2026-02-19 05:57:49'
WHERE `plots`.`id` IN ('43')
UPDATE `applications` SET `status` = 'selected', `updated_at` = '2026-02-19 05:57:49'
WHERE `applications`.`id` IN ('11')

    public function allotments()
    {
        $allotmentModel = new AllotmentModel();

        // Fetch allotments with application and user details
        $allotments = $allotmentModel
            ->select('allotments.*, applications.id as application_id, applications.full_name, users.name as user_name, chalans.id as chalan_id')
            ->join('applications', 'applications.id = allotments.application_id', 'left')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->join('chalans', 'chalans.allotment_id = allotments.id', 'left')
            ->orderBy('allotments.created_at', 'DESC')
            ->findAll();
---
SELECT `allotments`.*, `applications`.`id` as `application_id`, `applications`.`full_name`, `users`.`name` as `user_name`, `chalans`.`id` as `chalan_id`
FROM `allotments`
LEFT JOIN `applications` ON `applications`.`id` = `allotments`.`application_id`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
LEFT JOIN `chalans` ON `chalans`.`allotment_id` = `allotments`.`id`
ORDER BY `allotments`.`created_at` DESC

    public function allotmentDetail($id)
    {
        $allotmentModel = new AllotmentModel();
        $plotModel = new PlotModel();

        // Fetch allotment with application and user details
        $allotment = $allotmentModel
            ->select('allotments.*, applications.id as application_id, applications.user_id as application_user_id, applications.full_name, applications.mobile, applications.aadhaar, applications.address, applications.tehsil, applications.district, applications.state, applications.income, applications.income_category, applications.status as application_status, users.name as user_name, users.mobile as user_mobile, users.email as user_email')
            ->join('applications', 'applications.id = allotments.application_id', 'left')
            ->join('users', 'users.id = applications.user_id', 'left')
            ->where('allotments.id', $id)
            ->first();

        if (!$allotment) {
            return redirect()->to('/admin/allotments')->with('error', 'Allotment not found');
        }

        // Fetch plot details if plot_number exists
        $plot = null;
        if (!empty($allotment['plot_number'])) {
            $plot = $plotModel
                ->where('plot_number', $allotment['plot_number'])
                ->first();
        }

        // Fetch existing chalan for this allotment
        $chalanModel = new \App\Models\ChalanModel();
        $chalan = $chalanModel->where('allotment_id', $id)->orderBy('created_at', 'DESC')->first();
---
SELECT `allotments`.*, `applications`.`id` as `application_id`, `applications`.`user_id` as `application_user_id`, `applications`.`full_name`, `applications`.`mobile`, `applications`.`aadhaar`, `applications`.`address`, `applications`.`tehsil`, `applications`.`district`, `applications`.`state`, `applications`.`income`, `applications`.`income_category`, `applications`.`status` as `application_status`, `users`.`name` as `user_name`, `users`.`mobile` as `user_mobile`, `users`.`email` as `user_email`
FROM `allotments`
LEFT JOIN `applications` ON `applications`.`id` = `allotments`.`application_id`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `allotments`.`id` = '7'
 LIMIT 1
SELECT *
FROM `plots`
WHERE `plot_number` = 'E36'
 LIMIT 1
SELECT *
FROM `chalans`
WHERE `allotment_id` = '7'
ORDER BY `created_at` DESC
 LIMIT 1

    public function generateChalan($allotmentId)
    {
        $returnToList = (string) $this->request->getPost('return_to') === 'list';
        $toAllotment  = fn () => redirect()->to(site_url('admin/allotments/' . $allotmentId));
        $toAllotments = fn () => redirect()->to(site_url('admin/allotments'));

        if (strtolower($this->request->getMethod()) !== 'post') {
            return $toAllotments()->with('error', 'Invalid request');
        }

        $paModel = new \App\Models\PaymentAccountModel();
        if (empty($paModel->getAllActive())) {
            $msg = lang('App.adminChalanNoBankAccount') ?? 'Cannot generate chalan. Please add a bank account first from Chalans page.';
            return ($returnToList ? $toAllotments() : $toAllotment())->with('error', $msg);
        }

        $amount = (int) $this->request->getPost('amount');
        if ($amount <= 0) {
            return ($returnToList ? $toAllotments() : $toAllotment())->with('error', 'Please enter a valid amount');
        }

        $allotmentModel = new AllotmentModel();
        $allotment = $allotmentModel
            ->select('allotments.*, applications.id as application_id, applications.user_id')
            ->join('applications', 'applications.id = allotments.application_id', 'left')
            ->where('allotments.id', $allotmentId)
            ->first();
---
SELECT `allotments`.*, `applications`.`id` as `application_id`, `applications`.`user_id`
FROM `allotments`
LEFT JOIN `applications` ON `applications`.`id` = `allotments`.`application_id`
WHERE `allotments`.`id` = '7'
 LIMIT 1

        }

        $chalanModel = new \App\Models\ChalanModel();
        $existing = $chalanModel->where('allotment_id', $allotmentId)->where('status', 'pending')->first();
---
SELECT *
FROM `chalans`
WHERE `allotment_id` = '7'
AND `status` = 'pending'
 LIMIT 1

        ];

        try {
            if (! $chalanModel->insert($data)) {
---
INSERT INTO `chalans` (`allotment_id`, `application_id`, `user_id`, `chalan_number`, `amount`, `status`, `created_at`, `updated_at`) VALUES (7, 10, 10, 'CHAL-20260218-00002', 150000, 'pending', '2026-02-18 12:22:23', '2026-02-18 12:22:23')

    public function chalans()
    {
        $chalanModel = new \App\Models\ChalanModel();
        $chalans = $chalanModel
            ->select('chalans.*, applications.full_name, applications.mobile, allotments.plot_number, allotments.id as allotment_id, allotments.status as allotment_status')
            ->join('applications', 'applications.id = chalans.application_id', 'left')
            ->join('allotments', 'allotments.id = chalans.allotment_id', 'left')
            ->orderBy('chalans.created_at', 'DESC')
            ->findAll();
---
SELECT `chalans`.*, `applications`.`full_name`, `applications`.`mobile`, `allotments`.`plot_number`, `allotments`.`id` as `allotment_id`, `allotments`.`status` as `allotment_status`
FROM `chalans`
LEFT JOIN `applications` ON `applications`.`id` = `chalans`.`application_id`
LEFT JOIN `allotments` ON `allotments`.`id` = `chalans`.`allotment_id`
ORDER BY `chalans`.`created_at` DESC