app/Controllers/AuthPortal.php

    public function login()
    {
        // If already logged in, redirect to dashboard
        if (session()->has('user_id')) {
            return redirect()->to('/user/dashboard');
        }

        // Handle POST: process login (detect by presence of mobile field)
        if ($this->request->getPost('mobile') !== null) {
            $mobile   = (string) $this->request->getPost('mobile');
            $password = (string) $this->request->getPost('password');

            if (empty($mobile) || empty($password)) {
                return redirect()->back()->withInput()->with('error', 'Mobile and password are required');
            }

            $user = $this->userModel->where('mobile', $mobile)->first();
---
SELECT *
FROM `users`
WHERE `mobile` = '9602964437'
 LIMIT 1