app/Controllers/UserPortal.php

    public function dashboard()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to access your dashboard');
        }

        $userId = session()->get('user_id');

        // Get user's application if exists
        $application = $this->applicationModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->first();

        // Get eligibility data
        $eligibility = $this->eligibilityModel
            ->where('user_id', $userId)
            ->where('is_eligible', 1)
            ->first();
---
SELECT *
FROM `applications`
WHERE `user_id` = 15
ORDER BY `created_at` DESC
 LIMIT 1
SELECT *
FROM `eligibilities`
WHERE `user_id` = 15
AND `is_eligible` = 1
 LIMIT 1

                ->first();
            $documentsDone = (bool) $documents;

            $payment = $this->paymentModel
                ->where('user_id', $userId)
                ->where('application_id', $application['id'])
                ->where('status', 'success')
                ->orderBy('created_at', 'DESC')
                ->first();
---
SELECT *
FROM `payments`
WHERE `user_id` = 15
AND `application_id` = '11'
AND `status` = 'success'
ORDER BY `created_at` DESC
 LIMIT 1


        // Get pending chalans (final payment) for this user
        $chalanModel = new \App\Models\ChalanModel();
        $chalans = $chalanModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        // Check if user won the lottery (has an allotment)
        $allotmentModel = new \App\Models\AllotmentModel();
        $userAllotment = $allotmentModel
            ->select('allotments.id, allotments.plot_number, allotments.status as allotment_status')
            ->join('applications', 'applications.id = allotments.application_id', 'left')
            ->where('applications.user_id', $userId)
            ->first();
        $lotteryWon = (bool) $userAllotment;
        if ($userAllotment && ! empty($userAllotment['plot_number'])) {
            $plotModel = new \App\Models\PlotModel();
            $plot = $plotModel->where('plot_number', $userAllotment['plot_number'])->first();
---
SELECT *
FROM `chalans`
WHERE `user_id` = 15
ORDER BY `created_at` DESC
SELECT `allotments`.`id`, `allotments`.`plot_number`, `allotments`.`status` as `allotment_status`
FROM `allotments`
LEFT JOIN `applications` ON `applications`.`id` = `allotments`.`application_id`
WHERE `applications`.`user_id` = 15
 LIMIT 1
SELECT *
FROM `plots`
WHERE `plot_number` = 'E8'
 LIMIT 1


        // If no saved eligibility age, try to auto-fill from verified Aadhaar KYC DOB
        if (empty($existing['age'])) {
            $verifiedAadhaar = $this->aadhaarOtpModel
                ->where('user_id', $userId)
                ->where('verified', 1)
                ->orderBy('updated_at', 'DESC')
                ->first();
---
SELECT *
FROM `aadhaar_otps`
WHERE `user_id` = 9
AND `verified` = 1
ORDER BY `updated_at` DESC
 LIMIT 1

    public function application()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to submit application');
        }

        // Require eligibility to be completed and successful
        $userId = session()->get('user_id');
        $eligible = $this->eligibilityModel
            ->where('user_id', $userId)
            ->where('is_eligible', 1)
            ->first();

        if (! $eligible) {
            return redirect()->to('/user/eligibility')->with('error', 'Please complete eligibility check before filling the application form.');
        }

        // Check if user already has an application - redirect to edit if exists
        $application = $this->applicationModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT *
FROM `applications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1

                        'application_id' => $applicationId
                    ]);
                }
                return redirect()->to('/user/application')->with('success', 'Application updated successfully.');
---
SELECT *
FROM `applications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1

    public function chalanPay($chalanId)
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to pay chalan');
        }

        $userId = session()->get('user_id');
        $chalanModel = new \App\Models\ChalanModel();
        $chalan = $chalanModel->find($chalanId);
---
SELECT *
FROM `chalans`
WHERE `chalans`.`id` = '3'

            $db->transStart();

            try {
                $paymentId = $this->paymentModel->insert([
                    'user_id'        => $userId,
                    'application_id' => $chalan['application_id'],
                    'amount'         => $amount,
                    'status'         => 'success',
                    'transaction_ref'=> $transactionRef ?: 'CHALAN-' . $chalan['chalan_number'],
                ]);
---
INSERT INTO `payments` (`user_id`, `application_id`, `amount`, `status`, `transaction_ref`, `created_at`, `updated_at`) VALUES (15, '11', 100000, 'success', '1234567890', '2026-02-24 09:09:07', '2026-02-24 09:09:07')

                if ($paymentProofPath) {
                    $chalanUpdate['payment_proof'] = $paymentProofPath;
                }
                $chalanModel->update($chalanId, $chalanUpdate);

                $allotmentId = (int) ($chalan['allotment_id'] ?? 0);
                if ($allotmentId > 0) {
                    $allotmentRow = $db->table('allotments')->select('status')->where('id', $allotmentId)->get()->getRowArray();
                    if ($allotmentRow && strtolower((string)($allotmentRow['status'] ?? '')) === 'provisional') {
                        $db->table('allotments')->where('id', $allotmentId)->update(['status' => 'final']);
---
UPDATE `chalans` SET `status` = 'paid', `payment_id` = 10, `paid_at` = '2026-02-24 09:09:07', `payment_account_id` = 2, `payment_proof` = 'uploads/chalan_proofs/3_15_0c704e8c.png', `updated_at` = '2026-02-24 09:09:07'
WHERE `chalans`.`id` IN ('3')
SELECT `status`
FROM `allotments`
WHERE `id` = 8
UPDATE `allotments` SET `status` = 'final'
WHERE `id` = 8

    public function generateAadhaarOtp()
    {
        // Allow Aadhaar verification for both logged-in users and registration flow
        $userId = session()->has('user_id') ? session()->get('user_id') : 0; // 0 for registration flow

        // Get Aadhaar from POST or JSON
        $jsonData = $this->request->getJSON(true);
        $aadhaar = trim((string) ($this->request->getPost('aadhaar') ?? $jsonData['aadhaar'] ?? ''));

        // Remove any spaces or dashes from Aadhaar
        $aadhaar = preg_replace('/[\s\-]/', '', $aadhaar);

        // Validate Aadhaar number (12 digits)
        if (empty($aadhaar)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Aadhaar number is required'
            ]);
        }

        if (!preg_match('/^[0-9]{12}$/', $aadhaar)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Please enter a valid 12-digit Aadhaar number (You entered ' . strlen($aadhaar) . ' digits)'
            ]);
        }

        // Check if Aadhaar is already verified by any user
        $existingVerified = $this->aadhaarOtpModel
            ->where('aadhaar_number', $aadhaar)
            ->where('verified', 1)
            ->first();
---
SELECT *
FROM `aadhaar_otps`
WHERE `aadhaar_number` = '740099756128'
AND `verified` = 1
 LIMIT 1