app/Controllers/UserPortal.php

    public function dashboard()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to access your dashboard');
        }

        $userId = session()->get('user_id');

        // Get user's application if exists
        $application = $this->applicationModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->first();

        // Determine step completion based on DB records
        $eligibilityDone = (bool) $this->eligibilityModel
            ->where('user_id', $userId)
            ->where('is_eligible', 1)
            ->first();

        $documentsDone = false;
        $paymentDone   = false;

        if ($application) {
            $documentsDone = (bool) $this->documentModel
                ->where('user_id', $userId)
                ->where('application_id', $application['id'])
                ->first();

            $paymentDone = (bool) $this->paymentModel
                ->where('user_id', $userId)
                ->where('application_id', $application['id'])
                ->where('status', 'success')
                ->first();
---
SELECT *
FROM `applications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1
SELECT *
FROM `payments`
WHERE `user_id` = '1'
AND `application_id` = '2'
AND `status` = 'success'
 LIMIT 1

    public function eligibility()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to check eligibility');
        }

        $userId = session()->get('user_id');

        // Follow same pattern as AuthPortal (check POST by presence of field)
        if ($this->request->getPost('age') !== null) {
            $age            = (int) $this->request->getPost('age');
            $income         = (int) $this->request->getPost('income');
            $residency      = (string) $this->request->getPost('residency');
            $propertyStatus = (string) $this->request->getPost('property');

            // Basic rule derived from booklet-style conditions:
            // - Age between 18 and 70
            // - Some positive income
            // - Resident of state
            // - No existing residential property in scheme area
            $isEligible = $age >= 18
                && $age <= 70
                && $income > 0
                && $residency === 'state'
                && $propertyStatus === 'none';

            // Only store in DB when user is actually eligible
            if ($isEligible) {
                // Check if an eligibility record already exists for this user
                $existing = $this->eligibilityModel
                    ->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->first();
---
SELECT *
FROM `eligibilities`
WHERE `user_id` = 7
ORDER BY `created_at` DESC
 LIMIT 1

                if ($existing) {
                    $result = $this->eligibilityModel->update($existing['id'], $payload);
                } else {
                    $result = $this->eligibilityModel->insert($payload);
---
INSERT INTO `eligibilities` (`user_id`, `age`, `income`, `residency`, `property_status`, `is_eligible`, `created_at`, `updated_at`) VALUES (7, 33, 45466, 'state', 'none', 1, '2026-02-16 10:53:11', '2026-02-16 10:53:11')

    public function application()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to submit application');
        }

        // Require eligibility to be completed and successful
        $userId = session()->get('user_id');
        $eligible = $this->eligibilityModel
            ->where('user_id', $userId)
            ->where('is_eligible', 1)
            ->first();

        if (! $eligible) {
            return redirect()->to('/user/eligibility')->with('error', 'Please complete eligibility check before filling the application form.');
        }

        // Load latest application (if any) for pre-filling the form
        $application = $this->applicationModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT *
FROM `eligibilities`
WHERE `user_id` = '1'
AND `is_eligible` = 1
 LIMIT 1
SELECT *
FROM `applications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1

    public function applicationStatus()
    {
        // Check if user is logged in
        if (!session()->has('user_id')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to view application status');
        }

        $userId = session()->get('user_id');

        // Latest application for this user (if any)
        $application = $this->applicationModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->first();

        // Determine step completion based on DB records
        $eligibilityDone = (bool) $this->eligibilityModel
            ->where('user_id', $userId)
            ->where('is_eligible', 1)
            ->first();

        $documentsDone = false;
        $paymentDone   = false;

        if ($application) {
            $documentsDone = (bool) $this->documentModel
                ->where('user_id', $userId)
                ->where('application_id', $application['id'])
                ->first();

            $paymentDone = (bool) $this->paymentModel
                ->where('user_id', $userId)
                ->where('application_id', $application['id'])
                ->where('status', 'success')
                ->first();
---
SELECT *
FROM `applications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 1
SELECT *
FROM `eligibilities`
WHERE `user_id` = '1'
AND `is_eligible` = 1
 LIMIT 1
SELECT *
FROM `payments`
WHERE `user_id` = '1'
AND `application_id` = '2'
AND `status` = 'success'
 LIMIT 1