app/Models/ApplicationModel.php

    public function getApplicationsWithUsers()
    {
        return $this->select('applications.*, users.name as user_name, users.mobile, users.email')
                    ->join('users', 'users.id = applications.user_id', 'left')
                    ->orderBy('applications.created_at', 'DESC')
                    ->findAll();
---
SELECT `applications`.*, `users`.`name` as `user_name`, `users`.`mobile`, `users`.`email`
FROM `applications`
LEFT JOIN `users` ON `users`.`id` = `applications`.`user_id`
ORDER BY `applications`.`created_at` DESC