app/Models/ChalanModel.php

    public function generateChalanNumber(): string
    {
        $prefix = 'CHAL-' . date('Ymd') . '-';
        $last = $this->selectMax('id')->first();
---
SELECT MAX(`id`) AS `id`
FROM `chalans`
 LIMIT 1