app/Models/PaymentAccountModel.php

SELECT *
FROM `payment_accounts`
WHERE `is_active` = 1
ORDER BY `id` DESC
---
    public function getAllActive(): array
    {
        $rows = $this->where('is_active', 1)->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `payment_accounts`
ORDER BY `id` DESC
---
    public function getAll(): array
    {
        $rows = $this->orderBy('id', 'DESC')->findAll();